# parameters
nc: 20  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, Conv, [24, 3, 2] ],    # 0-P1/2
    
    [ -1, 1, FusedMBConv, [24, 1, 0.000] ], # 1
    [ -1, 1, FusedMBConv, [24, 1, 0.005] ], # 2
    [ -1, 1, FusedMBConv, [48, 2, 0.010] ], # 3-p2/4
    [ -1, 1, FusedMBConv, [48, 1, 0.015] ], # 4
    [ -1, 1, FusedMBConv, [48, 1, 0.020] ], # 5
    [ -1, 1, FusedMBConv, [48, 1, 0.025] ], # 6
    [ -1, 1, FusedMBConv, [64, 2, 0.030] ], # 7-p3/8
    [ -1, 1, FusedMBConv, [64, 1, 0.035] ], # 8
    [ -1, 1, FusedMBConv, [64, 1, 0.040] ], # 9
    [ -1, 1, FusedMBConv, [64, 1, 0.045] ], # 10
    
    [ -1, 1, MBConv, [ 128, 16, 4, 3, 2, 0.05 ] ], # 11-p4/16
    [ -1, 1, MBConv, [ 128, 32, 4, 3, 1, 0.055 ] ], # 12
    [ -1, 1, MBConv, [ 128, 32, 4, 3, 1, 0.060 ] ], # 13
    [ -1, 1, MBConv, [ 128, 32, 4, 3, 1, 0.065 ] ], # 14
    [ -1, 1, MBConv, [ 128, 32, 4, 3, 1, 0.070 ] ], # 15
    [ -1, 1, MBConv, [ 128, 32, 4, 3, 1, 0.075 ] ], # 16
    
    [ -1, 1, MBConv, [ 160, 32, 6, 3, 1, 0.080 ] ], # 17
    [ -1, 1, MBConv, [ 160, 40, 6, 3, 1, 0.085 ] ], # 18
    [ -1, 1, MBConv, [ 160, 40, 6, 3, 1, 0.090 ] ], # 19
    [ -1, 1, MBConv, [ 160, 40, 6, 3, 1, 0.095 ] ], # 20
    [ -1, 1, MBConv, [ 160, 40, 6, 3, 1, 0.100 ] ], # 21
    [ -1, 1, MBConv, [ 160, 40, 6, 3, 1, 0.105 ] ], # 22
    [ -1, 1, MBConv, [ 160, 40, 6, 3, 1, 0.110 ] ], # 23
    [ -1, 1, MBConv, [ 160, 40, 6, 3, 1, 0.115 ] ], # 24
    [ -1, 1, MBConv, [ 160, 40, 6, 3, 1, 0.120 ] ], # 25
    
    [ -1, 1, MBConv, [ 256, 40, 6, 3, 2, 0.125 ] ], # 26-p5/32
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.130 ] ], # 27
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.135 ] ], # 28
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.140 ] ], # 29
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.145 ] ], # 30
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.150 ] ], # 31
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.155 ] ], # 32
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.160 ] ], # 33
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.165 ] ], # 34
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.170 ] ], # 35
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.175 ] ], # 36
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.180 ] ], # 37
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.185 ] ], # 38
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.190 ] ], # 39
    [ -1, 1, MBConv, [ 256, 64, 6, 3, 1, 0.195 ] ], # 40
    
    [ -1, 1, Conv, [ 1280, 1, 1 ] ], # 41
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 42
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [25, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 54
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [10, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 66
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 54], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 79
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 42], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 92
   
   [66, 1, RepConv, [256, 3, 1]], # 93
   [79, 1, RepConv, [512, 3, 1]], # 94
   [92, 1, RepConv, [1024, 3, 1]], # 95

   [[93,94,95], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
