# parameters
nc: 20  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv_Hswish, [16, 2]],                 # 0-p1/2
   [-1, 1, MobileNet_Block_shuffle, [16,  16, 3, 1, 0, 0]],  # 1-p1/2
   [-1, 1, MobileNet_Block_shuffle, [24,  64, 3, 2, 0, 0]],  # 2-p2/4
   [-1, 1, MobileNet_Block_shuffle, [24,  72, 3, 1, 0, 0]],  # 3-p2/4
   [-1, 1, MobileNet_Block_shuffle, [40,  72, 5, 2, 1, 0]],  # 4-p3/8
   [-1, 1, MobileNet_Block_shuffle, [40,  120, 5, 1, 1, 0]], # 5-p3/8
   [-1, 1, MobileNet_Block_shuffle, [40,  120, 5, 1, 1, 0]], # 6-p3/8
   [-1, 1, MobileNet_Block_shuffle, [80,  240, 3, 2, 0, 1]], # 7-p4/16
   [-1, 1, MobileNet_Block_shuffle, [80,  200, 3, 1, 0, 1]], # 8-p4/16
   [-1, 1, MobileNet_Block_shuffle, [80,  184, 3, 1, 0, 1]], # 9-p4/16
   [-1, 1, MobileNet_Block_shuffle, [80,  184, 3, 1, 0, 1]], # 10-p4/16
   [-1, 1, MobileNet_Block_shuffle, [112,  480, 3, 1, 1, 1]], # 11-p4/16
   [-1, 1, MobileNet_Block_shuffle, [112,  672, 3, 1, 1, 1]], # 12-p4/16
   [-1, 1, MobileNet_Block_shuffle, [160,  672, 5, 1, 1, 1]], # 13-p4/16
   [-1, 1, MobileNet_Block_shuffle, [160,  672, 5, 2, 1, 1]], # 14-p5/32
   [-1, 1, MobileNet_Block_shuffle, [160,  960, 5, 1, 1, 1]], # 15-p5/32
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 16
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [13, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 28
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 40
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 28], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 53
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 16], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 66
   
   [40, 1, RepConv, [256, 3, 1]], # 67 
   [53, 1, RepConv, [512, 3, 1]], # 68
   [66, 1, RepConv, [1024, 3, 1]], # 69

   [[67,68,69], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
